results/ASPLOS/WILDFIRE/YCSB-ROCKSDB/50M-KEYS/ycsbwklde/8/CIPI_PERF.out
ERROR: ld.so: object '/usr/lib/lib_CIPI_PERF.so' from LD_PRELOAD cannot be preloaded (cannot open shared object file): ignored.
ERROR: ld.so: object '/usr/lib/lib_CIPI_PERF.so' from LD_PRELOAD cannot be preloaded (cannot open shared object file): ignored.
RocksDB:    version 5.4
Date:       Sun Mar  3 00:33:42 2024
CPU:        128 * AMD EPYC 7543 32-Core Processor
CPUCache:   512 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    50000000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    196266.2 MB (estimated)
FileSize:   98609.9 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
DB path: [/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA]
ycsbwklde    :     340.594 micros/op 2936 ops/sec; ( reads:11435 writes:564 total:50000000 found:0)
	Command being timed: "./db_bench --db=/users/kannan11/ssd/ioopt/appbench/apps/RocksDB-YCSB/DATA --num_levels=6 --key_size=20 --prefix_size=20 --memtablerep=prefix_hash --bloom_bits=10 --bloom_locality=1 --use_existing_db=1 --num=50000000 --duration=30 --compression_type=none --value_size=4096 --threads=8 --benchmarks=ycsbwklde --use_existing_db=1 --mmap_read=0 --threads=8"
	User time (seconds): 45.17
	System time (seconds): 15.21
	Percent of CPU this job got: 171%
	Elapsed (wall clock) time (h:mm:ss or m:ss): 0:35.29
	Average shared text size (kbytes): 0
	Average unshared data size (kbytes): 0
	Average stack size (kbytes): 0
	Average total size (kbytes): 0
	Maximum resident set size (kbytes): 1637596
	Average resident set size (kbytes): 0
	Major (requiring I/O) page faults: 79
	Minor (reclaiming a frame) page faults: 681267
	Voluntary context switches: 3000142
	Involuntary context switches: 210
	Swaps: 0
	File system inputs: 29474800
	File system outputs: 2253976
	Socket messages sent: 0
	Socket messages received: 0
	Signals delivered: 0
	Page size (bytes): 4096
	Exit status: 0
[ 8187.338077] sh (42720): drop_caches: 3
[ 8187.398648] sh (42727): drop_caches: 3